SunAndShadowSettings Property
 The sun and shadow settings assigned to the view for shadow calculation and rendering.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public SunAndShadowSettings SunAndShadowSettings { get; }
  Visual Basic
Public ReadOnly Property SunAndShadowSettings As SunAndShadowSettings
	Get
  Visual C++
public:
property SunAndShadowSettings^ SunAndShadowSettings {
	SunAndShadowSettings^ get ();
}
 Field Value
 The sun and shadow settings, or null for views which don't allow this (such as schedules).
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →